{
  "skills": [
    {
      "Languages": " English | Afrikaans | Greek\n\nDriver’s License Code B\n\nMarital Status Married\n\n"
    }
  ],
  "basics": {
    "gender": "male",
    "name": {
      "firstName": "Nicholas",
      "surname": "Simigiannis",
      "middleName": "Michael"
    },
    "title": "Software Engineer",
    "email": [
      "nicksimi@gmail.com",
      "tonmanayo@hotmail.com"
    ]
  },
  "credibility": [
    {
      "References": " & Certificates Presented upon request\n\nAvailability One month notice period\n\nPP RROO FFEE SSSSIIOO NNAALL SSTT RREENNGG TT HHSS\n\n­ An incurably curious and tenacious researcher and project leader, with\n\ncommensurate passion and dedication to\n\nsolving client problems.\n\n­ Excellent rapport with people and clients, with invaluable stakeholder engagement and\n\nnetworking abilities.\n\n­ Resilient critical thinker with dependable and industrious approach to creating opportunity\n\nand identifying hidden resources; a value\n\ncreator.\n\n­ Respected as team leader and subject matter expert, always open to new ideas and\n\ncollaborative professional journeying.\n\n­ Ideation specialist and facilitator in innovation and technology business\n\nimprovement drives.\n\n­ Results-orientated and capable , with extensive travel and cross-cultural\n\ncommunications expertise at all organisational\n\nlevels, internally and externally.\n"
    }
  ],
  "extracurricular": [
    {
      "Extracurricular Activities": " Sport (soccer, tennis, squash, golf, road running) | Adventure &\n\nTravel | Reading (business, management, auto-biographies,\n\nfantasy, science fiction) | Poker | Gaming\n\n"
    }
  ],
  "work_experience": [
    {
      "Project": " Management; Data Science; Research and Development; Strategic Consulting; Interest Rates\n\nDerivatives Trading; Software Engineering; Financial Crime Intelligence; Team Leadership, and Integration\n\nof Arti ficial Intelligence (AI) into Organisational Structures.\n\nHe is passionate about innovation, technology and problem -solving, particularly in the fields of data science\n\nand arti ficial intelligence. In both his personal and professional capacity, Nicholas actively researches and\n\ndevelops solutions to challenging problems that are AI and technology -based. He has expertise in machine\n\nlearning, enterprise chatbot design using natural language processing ( NLP) and big-data technologies, with\n\n5 years’ experience in the project management and team leadership of large data analytics projects .\n\nHe has a deep understanding of investment banking, data analytics, derivatives pricing, big system\n\nimplementations, and the challenges associated with successful implementation of enabling solutio ns. His\n\nunique combination of system and business understanding, and appreciation of strategic concerns of an\n\norganisation, allows him to deliver innovative solutions that enable technically sound business decisions.\n\nRegarded as a strategic business advisor to organisational leadership on AI and analytics-based solutions,\n\nNicholas rapidly acquires new data-science technical skills to maintain industry leadership.\n\nNicholas is actively developing his technical skills including learning Python, R, Spark and t he Hadoop\n\nplatform. An avid professional development champion and committed autodidact, Nicholas continuously\n\nnurtures his inventive nature, diverse and upwardly mobile data science capabilities, and exemplary leadership\n\nskills to drive novelty and success in every new project he tackles, with energy and passion.\n\nHaving been both software engineer and derivatives trader at a major investment bank, he is currently\n\nfulfilling an experimental data science role in a team focussed on disruptive innovation for wholesale and\n\ninvestment banking. His earlier consulting, sales and data analytics project and team leadership experiences\n\nhave grounded Nicholas well to navigate the multiple paradigms and associated shifts required to implement\n\nsolutions to the biggest business challenges that organisations face currently.\n\nNicholas equally developed innate understanding of the global Financial Technology (Fintech) and\n\ninnovation ecosystems. He is a firm believer that data science skill-sharing facilitation and education\n\nenhances internal and external buy-in and collaborative change. He recently arranged a highly successful 6-\n\nweek Python Boot Camp for 100 beginners in his organisation, effectively providing his inexperienced\n\nprofessional colleagues with relevant coding skills in Python and Data Science.\n\nNicholas is currently also tutoring students completing their Course in Arti ficial Intelligence and the\n\nImplications for Business Strategy through the MIT Sloan School of Management.\n\nCareer Objectives: Data Science Project Lead \/ Manager (Innovation \/ Digital Disruption in Banking)\n\nD a t a S c i e n c e P r o j e c t L e a d\n\nCurriculum Vitae of Nicholas Michael Simigiannis Page 2\/6\n\nAA RREE AA SS OOFF EE XX PP EE RRTT II SS EE\n\n­ Project Management and\n\nTeam Leadership of Data\n\n"
    },
    {
      "Analytics Projects": "\n\n­ Research & Application of\n\nExisting Market Solutions to\n\nBusiness Problems\n\n­ Enterprise Research &\n\nDevelopment in Artificial\n\nIntelligence (AI) and Machine\n\nLearning\n\n­ General Project Management\n\n­ Stakeholder Engagement\n\n­ Chat-bot Architecture & Design\n\n­ Machine Learning\n\n­ Python & SQL (Intermediate)\n\n­ R & Spark & Hadoop (beginner)\n\n­ Natural Language Processing\n\n­ Sentiment Analysis\n\n­ Data Visualisation\n\n­ Software Engineering\n\n­ Investment Bank ing\n\n­ Management Consulting\n\n­ Trading & Risk Management\n\n­ Financial Instrument &\n\nDerivatives Pricing\n\n­ Sales Sk ills in Trading &\n\nConsulting\n\n­ Anti-Money Laundering\n\n(AML)\n\nQQUU AALL II FFIICCAA TTIIOO NNSS\n\nMaster of Business Administration International MBA Exchange Programme; Fuqua School of\n\nBusiness, "
    },
    {
      "date_start": "2013",
      "organization": "Duke",
      "text": "\n\nMaster of Business Administration Full-Time Programme; Graduate School of Business, University of\n\nCape Town, 2012 Best-performing student in core MBA Strategy course; Selected to represent UCT GSB at\n\nJohn Molson MBA International Business Case Competition\n\nMaster of Engineering in Software and Information Engineering; University of the Witwatersrand, 2005\n\nBachelor of Science Honours in Electrical (Information) Engineering; University of the Witwatersrand, 2004\n\nReceived Chancellor’s Award for Academic Performance; Awarded Standard Bank Scholarship for Masters\n\nin Engineering\n\nSenior Certificate \/ Matric; Boksburg High School, 2000 Awarded Wits Scholarship for Electrical\n\nEngineering\n\nCC OOUURRSS EE SS CCOOMM PP LLEE TTEE DD\n\nStatistics with R Specialization; "
    },
    {
      "date_start": "2017",
      "organization": "Duke",
      "text": "\n\nMachine Learning A-Z, Udemy, 2017\n\nThe Ultimate Hands-On Hadoop, Udemy, 2017\n\nBuild Incredible Chatbots, Udemy, 2017\n\nChatBots: Messenger ChatBot with API.AI and Node.JS, Udemy, 2016\n\nMachine Learning; Stanford University, Coursera, "
    },
    {
      "date_start": "2016",
      "jobtitle": "Developer",
      "text": "’s Guide to the Internet of Things (IoT); "
    },
    {
      "date_start": "2016",
      "organization": "IBM",
      "text": " Digital Marketing Specialisation; University of Illinois, Coursera, 2016\n\nD a t a S c i e n c e P r o j e c t L e a d\n\nCurriculum Vitae of Nicholas Michael Simigiannis Page 3\/6\n\nUX & Web Design Master Course : Strategy, Design, Development; Udemy, 2016 A Life of Happiness & Fulfilment; Indian School of Business, Coursera, 2016\n\nCertified Agile Scrum Master; Scrum Alliance, 2015\n\nThe Data Scientist’s Toolbox; Johns Hopkins University, Coursera, 2015 Gamification; Customer & Operations Analytics; University of Pennsylvania, Coursera, 2015\n\nLearning Python for Data Analysis and Visualisation; Udemy, "
    },
    {
      "date_start": "2015",
      "organization": "University of Reading",
      "text": ", 2008\n\nPP RROO FFEE SSSSIIOO NNAALL EE XXPPEERRII EENN CCEE\n\nCC UURR RREE NNTT TTEE NN UURREE\n\nRMB FOUNDeRY [February 2017 to Date]\n\nData Science Project Lead\n\nCompany Overview:\n\n­ The FOUNDeRY is a division of Rand Merchant Bank (RMB), launched to create a space for disruption and Fintech innovation that transforms corporate and investment banking by applying innovative\n\nsolutions to client needs with pioneering technology and by leveraging unique approaches to\n\ncollaboration and partnership.\n\n­ Employs techno-savvy pathfinders of digital disruption to develop the technology -led guidance, platforms, systems and products that make banking more relevant in the future, by challenging existing\n\nprecepts and dissecting past methods to create new potential outcomes.\n\nCore Overview:\n\n­ Leads research and development activities to identify how AI and data analytics solutions can be applied to solve the Bank’s most challenging business problems.\n\n­ Devises innovative tech solutions that can change the way wholesale banking works, by capitalising on collective genius, challenging conformity and enabling human potential with disruptive solutions (e.g.\n\ncrypto-currencies, block chain, data science and modern software engineering).\n\n­ Applies arti ficial intelligence as complement and booster of organisational work forces. ­ Continuously and rapidly acquires new data-science technical skills to maintain industry leadership\n\nposition | Details knowledge acquisition progress via blog: http:\/\/foundery.co.za\/blog\/a-curriculum-for-\n\ngrowing-your-data-science-skills-almost-for-free\/.\n\nDuties & Responsibilities:\n\n­ As FOUNDeRY data science project lead, provides leadership by directing technical and management responsibilities of data science experiments | Engages and works closely with the Bank's C-Suite and\n\nmanagement board to brainstorm AI integration needs and possibilities.\n\n­ Experiments with AI and machine learning technologies and platforms, advising key stakeholders on solution viability | Hosts strategic workshops with key stakeholders, liaises with local and global AI\n\nsolution providers | Develops and implements AI solutions by applying technical skills.\n\n­ Engages and provides regular feedback to RMB’s Business Unit Heads and the Management Board members on key challenges FOUNDeRY team is helping to solve.\n\n­ Leads implementation teams and development activities.\n\nD a t a S c i e n c e P r o j e c t L e a d\n\nCurriculum Vitae of Nicholas Michael Simigiannis Page 4\/6\n\n"
    },
    {
      "Key Projects": " to Date at FOUNDeRY:\n\n­ Fraud analytics: machine learning approach to suspicious transaction monitoring. ­ People analytics: improving staff decision-making processes with data and AI to better utilise data and\n\nalgorithms.\n\n­ Chat-bots, NLP and sentiment analysis: chatbots developed for client employees using natural language processing (NLP) API’s and multiple channel integrations .\n\n­ Implementing big data (Hadoop) and cloud (Azure) data analytics infrastructure: built a FOUNDeRY HADOOP Data Lab for internal experimentation.\n\n­ Researching global AI Fintech ecosystem. ­ Performed extensive global competitive AI, machine learning and digital banking research studies.\n\nPP RRII OORR TTEE NNUU RREE SS\n\nDeloitte South Africa \/ Risk Advisory ["
    },
    {
      "date_start": "June 2013",
      "jobtitle": "Manager",
      "text": ": Data Analytics\n\nCore Overview:\n\n­ Acted as senior leadership resource within Risk Advisory Advanced Analytics team. ­ Team leader of the Advanced Analytics team and competency, with responsibility to manage, train and\n\nnurtured a 20-person team which played key role in business ac hievement of > ZAR 150 million Annual\n\nRevenue Target (FY2016).\n\n­ Achieved success by focus ing on sales and new business wins, surpassing personal sales target of > ZAR 15 million (FY2016).\n\nDuties & Responsibilities:\n\n­ Assumed full accountability for engagement, project management and delivery of multiple finance-based data analytics projects. Successfully completed or currently delivered projects (FY2016) include:\n\n· Managed team delivering Digital Banking Transformation for large financial institution: Data analytics solution now drives digital strategy, enhancing decision-making. Currently, data design, analytics\n\nimplementation, visualisation and 18-month digital strategy roadmap is being rolled out.\n\n· Led team that designed and implemented a data-mart, integrating and visualising multiple years’ transactional, credit, finance and regulatory data. Achieved goals of ensuring Regulatory Compliance\n\n(BCBS, AML) and improving decision-making abilities of the business banking team at large financial\n\nservices organisation.\n\n· Directed team that successfully implemented a system to drive operational management and remediation efforts in an Anti-Money Laundering (AML) remediation project valued at ZAR 300 million,\n\nwithin business banking division of large financial services company.\n\n­ Drove innovation and brand-building initiatives within Data Analytics team. FY2016 highlights include:\n\n· Architected novel Internal Analytics and Macro-Economic Solution that produced in-depth, granular insights for companies looking to do business in A frica, by integrating multiple disparate public and\n\ncompany-specific data sets. Pitched to Executive Committee, concept was successfully funded.\n\n· Started local Sports Analytics Initiative to help professional sports teams improve performance and\n\ndecision-making by becoming more data-driven. Created value for teams by implementing data\n\nmanagement, advanced analytics statistical modelling, and integrating disparate data-sets across\n\nmultiple sporting codes.\n\nD a t a S c i e n c e P r o j e c t L e a d\n\nCurriculum Vitae of Nicholas Michael Simigiannis Page 5\/6\n\n· Launched Cognitive Analytics Initiative aimed at enabling implementation of IBM Watson or similar\n\nquestion-answering computer system at financial services and insurance companies. Hosted first-ever\n\nfruitful Cognitive Analytics event in SA in partnership with IBM.\n\n18-Month Sabbatical to pursue (and achieve) MBA on Full-Time Basis ["
    },
    {
      "date_start": "January 2012",
      "organization": "Bank",
      "text": " of South Africa Limited [January 2007 to August 2011]\n\nCore Overview:\n\n­ Upon completion of Masters in Software Engineering (Wits), was selected to join Standard Bank’s 1-year Graduate Development Programme as Software Engineer.\n\n­ On commendation, was seconded to Global Markets Technology team to lead new product development and support of existing platforms on Standard Bank interest rate derivatives desk .\n\n­ After three years of consistent service and learning, joined team as an Interest Rates Derivatives and Fixed Income trader.\n\nInterest Rate Derivatives and Fixed Income Trader [February 2010 to August 2011]\n\n­ Market-made SA government bonds and repurchase agreements, providing clients with market liquidity on request.\n\n­ Achieved aggressive annual revenue target of ZAR 20 million p.a. by applying sound risk \/ return and disciplined trading techniques | Key acquired sk ill: Making vital real-time decisions under intense\n\npressure with often imperfect information.\n\n­ Built effective working relationships with internal and external clients, and other primary dealers, resulting in new and return IRD business.\n\n­ Actively traded secondary SA government bond market and participated in weekly government bond auction.\n\n­ Completed daily end-of-day revenue and risk procedures, ensuring that desk’s Profit & Loss and risk figures were accurately reported to Head of Desk and Head of Global Markets division.\n\nIRD Business Support and Development [June 2007 to January 2010]\n\n­ Assumed front-office role, working directly with traders and sales teams. ­ Provided technical business, IT support and development to IRD trading desk, ZAR 500 million annual\n\nbusiness.\n\n­ Developed new products, allowing trading desk to grow product base and revenues. ­ Key technical lead on one of the Bank’s biggest transformational projects, migrating and upgrading the\n\nthen core IRD risk management system called Infinity to Murex.\n\n­ Successfully completed 3-month Murex embedment programme in Paris. ­ Key achievement: Acted as Lead Developer in major ZAR 120 million project to upgrade bank’s IRD\n\ntrading system: Managed trade migration | Developed critical trade feed between the bank and bond\n\nexchange – providing the traders with accurat e real-time risk and P&L data.\n\n­ Managed team of software developers, providing detailed level of specifications, guidance and support that ensured successful completion of key project deliverables.\n\nStandard "
    },
    {
      "date_start": "June 2007",
      "organization": "Bank",
      "text": "]\n\n­ Developed centralised server information database and front-end, resulting in real-time view of entire bank’s server data, and increasing efficiency and productivity of server management team.\n\nD a t a S c i e n c e P r o j e c t L e a d\n\nCurriculum Vitae of Nicholas Michael Simigiannis Page 6\/6\n\n­ After being selected as a top Graduate on the Programme, received 3-month secondment to trading and risk management software vendor in France (Murex, mentioned above) in preparation for a major IT\n\ntrading system upgrade project.\n\nPP EERR SSOONN AALL DDEE TT AAII LLSS\n\nDate of Birth "
    },
    {
      "date_start": "2 August 1982",
      "organization": "EU",
      "text": "]\n\n"
    }
  ]
}